OpenNuvoton/M030GBSP/Library/Device/Nuvoton/M030G/Include/pdma_reg.h
#define PDMA_DSCT_CTL_OPMODE_Pos        (0)                                              /*!< DSCT_T::CTL: OPMODE Position          */
#define PDMA_DSCT_CTL_OPMODE_Msk        (0x3ul << PDMA_DSCT_CTL_OPMODE_Pos)              /*!< DSCT_T::CTL: OPMODE Mask              */

#define PDMA_DSCT_CTL_TXTYPE_Pos        (2)                                              /*!< DSCT_T::CTL: TXTYPE Position          */
#define PDMA_DSCT_CTL_TXTYPE_Msk        (0x1ul << PDMA_DSCT_CTL_TXTYPE_Pos)              /*!< DSCT_T::CTL: TXTYPE Mask              */

#define PDMA_DSCT_CTL_BURSIZE_Pos       (4)                                              /*!< DSCT_T::CTL: BURSIZE Position         */
#define PDMA_DSCT_CTL_BURSIZE_Msk       (0x7ul << PDMA_DSCT_CTL_BURSIZE_Pos)             /*!< DSCT_T::CTL: BURSIZE Mask             */

#define PDMA_DSCT_CTL_TBINTDIS_Pos      (7)                                              /*!< DSCT_T::CTL: TBINTDIS Position        */
#define PDMA_DSCT_CTL_TBINTDIS_Msk      (0x1ul << PDMA_DSCT_CTL_TBINTDIS_Pos)            /*!< DSCT_T::CTL: TBINTDIS Mask            */

#define PDMA_DSCT_CTL_SAINC_Pos         (8)                                              /*!< DSCT_T::CTL: SAINC Position           */
#define PDMA_DSCT_CTL_SAINC_Msk         (0x3ul << PDMA_DSCT_CTL_SAINC_Pos)               /*!< DSCT_T::CTL: SAINC Mask               */

#define PDMA_DSCT_CTL_DAINC_Pos         (10)                                             /*!< DSCT_T::CTL: DAINC Position           */
#define PDMA_DSCT_CTL_DAINC_Msk         (0x3ul << PDMA_DSCT_CTL_DAINC_Pos)               /*!< DSCT_T::CTL: DAINC Mask               */

#define PDMA_DSCT_CTL_TXWIDTH_Pos       (12)                                             /*!< DSCT_T::CTL: TXWIDTH Position         */
#define PDMA_DSCT_CTL_TXWIDTH_Msk       (0x3ul << PDMA_DSCT_CTL_TXWIDTH_Pos)             /*!< DSCT_T::CTL: TXWIDTH Mask             */

#define PDMA_DSCT_CTL_TXCNT_Pos         (16)                                             /*!< DSCT_T::CTL: TXCNT Position           */
#define PDMA_DSCT_CTL_TXCNT_Msk         (0xfffful << PDMA_DSCT_CTL_TXCNT_Pos)            /*!< DSCT_T::CTL: TXCNT Mask               */

#define PDMA_DSCT_SA_SA_Pos             (0)                                              /*!< DSCT_T::SA: SA Position               */
#define PDMA_DSCT_SA_SA_Msk             (0xfffffffful << PDMA_DSCT_SA_SA_Pos)            /*!< DSCT_T::SA: SA Mask                   */

#define PDMA_DSCT_DA_DA_Pos             (0)                                              /*!< DSCT_T::DA: DA Position               */
#define PDMA_DSCT_DA_DA_Msk             (0xfffffffful << PDMA_DSCT_DA_DA_Pos)            /*!< DSCT_T::DA: DA Mask                   */

#define PDMA_DSCT_NEXT_NEXT_Pos         (0)                                              /*!< DSCT_T::NEXT: NEXT Position           */
#define PDMA_DSCT_NEXT_NEXT_Msk         (0xfffful << PDMA_DSCT_NEXT_NEXT_Pos)            /*!< DSCT_T::NEXT: NEXT Mask               */

#define PDMA_DSCT_NEXT_EXENEXT_Pos      (16)                                             /*!< DSCT_T::NEXT: EXENEXT Position        */
#define PDMA_DSCT_NEXT_EXENEXT_Msk      (0xfffful << PDMA_DSCT_NEXT_EXENEXT_Pos)         /*!< DSCT_T::NEXT: EXENEXT Mask            */

#define PDMA_CURSCAT_CURADDR_Pos        (0)                                              /*!< PDMA_T::CURSCAT: CURADDR Position     */
#define PDMA_CURSCAT_CURADDR_Msk        (0xfffffffful << PDMA_CURSCAT_CURADDR_Pos)       /*!< PDMA_T::CURSCAT: CURADDR Mask         */

#define PDMA_CHCTL_CHENn_Pos            (0)                                              /*!< PDMA_T::CHCTL: CHENn Position         */
#define PDMA_CHCTL_CHENn_Msk            (0x1ful << PDMA_CHCTL_CHENn_Pos)                 /*!< PDMA_T::CHCTL: CHENn Mask             */

#define PDMA_PAUSE_PAUSEn_Pos           (0)                                              /*!< PDMA_T::PAUSE: PAUSEn Position        */
#define PDMA_PAUSE_PAUSEn_Msk           (0x1ful << PDMA_PAUSE_PAUSEn_Pos)                /*!< PDMA_T::PAUSE: PAUSEn Mask            */

#define PDMA_SWREQ_SWREQn_Pos           (0)                                              /*!< PDMA_T::SWREQ: SWREQn Position        */
#define PDMA_SWREQ_SWREQn_Msk           (0x1ful << PDMA_SWREQ_SWREQn_Pos)                /*!< PDMA_T::SWREQ: SWREQn Mask            */

#define PDMA_TRGSTS_REQSTSn_Pos         (0)                                              /*!< PDMA_T::TRGSTS: REQSTSn Position      */
#define PDMA_TRGSTS_REQSTSn_Msk         (0x1ful << PDMA_TRGSTS_REQSTSn_Pos)              /*!< PDMA_T::TRGSTS: REQSTSn Mask          */

#define PDMA_PRISET_FPRISETn_Pos        (0)                                              /*!< PDMA_T::PRISET: FPRISETn Position     */
#define PDMA_PRISET_FPRISETn_Msk        (0x1ful << PDMA_PRISET_FPRISETn_Pos)             /*!< PDMA_T::PRISET: FPRISETn Mask         */

#define PDMA_PRICLR_FPRICLRn_Pos        (0)                                              /*!< PDMA_T::PRICLR: FPRICLRn Position     */
#define PDMA_PRICLR_FPRICLRn_Msk        (0x1ful << PDMA_PRICLR_FPRICLRn_Pos)             /*!< PDMA_T::PRICLR: FPRICLRn Mask         */

#define PDMA_INTEN_INTENn_Pos           (0)                                              /*!< PDMA_T::INTEN: INTENn Position        */
#define PDMA_INTEN_INTENn_Msk           (0x1ful << PDMA_INTEN_INTENn_Pos)                /*!< PDMA_T::INTEN: INTENn Mask            */

#define PDMA_INTSTS_ABTIF_Pos           (0)                                              /*!< PDMA_T::INTSTS: ABTIF Position        */
#define PDMA_INTSTS_ABTIF_Msk           (0x1ul << PDMA_INTSTS_ABTIF_Pos)                 /*!< PDMA_T::INTSTS: ABTIF Mask            */

#define PDMA_INTSTS_TDIF_Pos            (1)                                              /*!< PDMA_T::INTSTS: TDIF Position         */
#define PDMA_INTSTS_TDIF_Msk            (0x1ul << PDMA_INTSTS_TDIF_Pos)                  /*!< PDMA_T::INTSTS: TDIF Mask             */

#define PDMA_INTSTS_ALIGNF_Pos          (2)                                              /*!< PDMA_T::INTSTS: ALIGNF Position       */
#define PDMA_INTSTS_ALIGNF_Msk          (0x1ul << PDMA_INTSTS_ALIGNF_Pos)                /*!< PDMA_T::INTSTS: ALIGNF Mask           */

#define PDMA_INTSTS_REQTOF0_Pos         (8)                                              /*!< PDMA_T::INTSTS: REQTOF0 Position      */
#define PDMA_INTSTS_REQTOF0_Msk         (0x1ul << PDMA_INTSTS_REQTOF0_Pos)               /*!< PDMA_T::INTSTS: REQTOF0 Mask          */

#define PDMA_INTSTS_REQTOF1_Pos         (9)                                              /*!< PDMA_T::INTSTS: REQTOF1 Position      */
#define PDMA_INTSTS_REQTOF1_Msk         (0x1ul << PDMA_INTSTS_REQTOF1_Pos)               /*!< PDMA_T::INTSTS: REQTOF1 Mask          */

#define PDMA_ABTSTS_ABTIF0_Pos          (0)                                              /*!< PDMA_T::ABTSTS: ABTIF0 Position       */
#define PDMA_ABTSTS_ABTIF0_Msk          (0x1ul << PDMA_ABTSTS_ABTIF0_Pos)                /*!< PDMA_T::ABTSTS: ABTIF0 Mask           */

#define PDMA_ABTSTS_ABTIF1_Pos          (1)                                              /*!< PDMA_T::ABTSTS: ABTIF1 Position       */
#define PDMA_ABTSTS_ABTIF1_Msk          (0x1ul << PDMA_ABTSTS_ABTIF1_Pos)                /*!< PDMA_T::ABTSTS: ABTIF1 Mask           */

#define PDMA_ABTSTS_ABTIF2_Pos          (2)                                              /*!< PDMA_T::ABTSTS: ABTIF2 Position       */
#define PDMA_ABTSTS_ABTIF2_Msk          (0x1ul << PDMA_ABTSTS_ABTIF2_Pos)                /*!< PDMA_T::ABTSTS: ABTIF2 Mask           */

